# coding: utf-8

item_1_black = {
    "1012": "2023-04-04T20:42:00+03:00",
    "1018": "112233445573",
    "1020": 1,
    "1021": "Autotestov A.",
    "1031": 1,
    "1037": "0000000001047959",
    "1038": 97,
    "1040": 427,
    "1041": "9999078945337305",
    "1042": 8,
    "1054": 1,
    "1055": 1,
    "1059": [
        {
            "1023": 1,
            "1030": "Характеристики. Товар с характером 1. Отдельная позиция на каждую характеристику Черный",
            "1043": 1,
            "1079": 1,
            "1199": 6,
            "1212": 1
        }
    ],
    "1077": "3104656171FA",
    "1081": 0,
    "1105": 1,
    "1209": 2,
    "1215": 0,
    "1216": 0,
    "1217": 0,
    "fiscalDocumentType": "receipt",
    "qr": "t=20230404T2042&s=1.00&fn=9999078945337305&i=427&fp=1700884986&n=1",
    "short": False
}

item_1_white = {
    "1012": "2023-04-04T20:42:00+03:00",
    "1018": "112233445573",
    "1020": 2,
    "1021": "Autotestov A.",
    "1031": 2,
    "1037": "0000000001047959",
    "1038": 97,
    "1040": 428,
    "1041": "9999078945337305",
    "1042": 9,
    "1054": 1,
    "1055": 1,
    "1059": [
        {
            "1023": 1,
            "1030": "Характеристики. Товар с характером 1. Отдельная позиция на каждую характеристику Белый",
            "1043": 2,
            "1079": 2,
            "1199": 6,
            "1212": 1
        }
    ],
    "1077": "3104DB190564",
    "1081": 0,
    "1105": 2,
    "1209": 2,
    "1215": 0,
    "1216": 0,
    "1217": 0,
    "fiscalDocumentType": "receipt",
    "qr": "t=20230404T2042&s=2.00&fn=9999078945337305&i=428&fp=3675850084&n=1",
    "short": False
}

item_2_blue = {
    "1012": "2023-04-04T20:42:00+03:00",
    "1018": "112233445573",
    "1020": 1,
    "1021": "Autotestov A.",
    "1031": 1,
    "1037": "0000000001047959",
    "1038": 97,
    "1040": 429,
    "1041": "9999078945337305",
    "1042": 10,
    "1054": 1,
    "1055": 1,
    "1059": [
        {
            "1023": 1,
            "1030": "Характеристики. Товар с характером 2. Одна позиция на все характеристики Синий",
            "1043": 1,
            "1079": 1,
            "1199": 6,
            "1212": 1
        }
    ],
    "1077": "31047A2D92A5",
    "1081": 0,
    "1105": 1,
    "1209": 2,
    "1215": 0,
    "1216": 0,
    "1217": 0,
    "fiscalDocumentType": "receipt",
    "qr": "t=20230404T2042&s=1.00&fn=9999078945337305&i=429&fp=2049807013&n=1",
    "short": False
}

item_2_yellow = {
    "1012": "2023-04-04T20:42:00+03:00",
    "1018": "112233445573",
    "1020": 2,
    "1021": "Autotestov A.",
    "1031": 2,
    "1037": "0000000001047959",
    "1038": 97,
    "1040": 430,
    "1041": "9999078945337305",
    "1042": 11,
    "1054": 1,
    "1055": 1,
    "1059": [
        {
            "1023": 1,
            "1030": "Характеристики. Товар с характером 2. Одна позиция на все характеристики Желтый",
            "1043": 2,
            "1079": 2,
            "1199": 6,
            "1212": 1
        }
    ],
    "1077": "3104D455F83F",
    "1081": 0,
    "1105": 2,
    "1209": 2,
    "1215": 0,
    "1216": 0,
    "1217": 0,
    "fiscalDocumentType": "receipt",
    "qr": "t=20230404T2042&s=2.00&fn=9999078945337305&i=430&fp=3562403903&n=1",
    "short": False
}

item_1_black_and_white = {
    "1012": "2023-04-04T20:43:00+03:00",
    "1018": "112233445573",
    "1020": 3,
    "1021": "Autotestov A.",
    "1031": 3,
    "1037": "0000000001047959",
    "1038": 97,
    "1040": 431,
    "1041": "9999078945337305",
    "1042": 12,
    "1054": 1,
    "1055": 1,
    "1059": [
        {
            "1023": 1,
            "1030": "Характеристики. Товар с характером 1. Отдельная позиция на каждую характеристику Белый",
            "1043": 2,
            "1079": 2,
            "1199": 6,
            "1212": 1
        },
        {
            "1023": 1,
            "1030": "Характеристики. Товар с характером 1. Отдельная позиция на каждую характеристику Черный",
            "1043": 1,
            "1079": 1,
            "1199": 6,
            "1212": 1
        }
    ],
    "1077": "31046DC60ECD",
    "1081": 0,
    "1105": 3,
    "1209": 2,
    "1215": 0,
    "1216": 0,
    "1217": 0,
    "fiscalDocumentType": "receipt",
    "qr": "t=20230404T2043&s=3.00&fn=9999078945337305&i=431&fp=1841696461&n=1",
    "short": False
}

item_2_yellow_and_blue = {
    "1012": "2023-04-04T20:43:00+03:00",
    "1018": "112233445573",
    "1020": 3,
    "1021": "Autotestov A.",
    "1031": 3,
    "1037": "0000000001047959",
    "1038": 97,
    "1040": 432,
    "1041": "9999078945337305",
    "1042": 13,
    "1054": 1,
    "1055": 1,
    "1059": [
        {
            "1023": 1,
            "1030": "Характеристики. Товар с характером 2. Одна позиция на все характеристики Желтый",
            "1043": 2,
            "1079": 2,
            "1199": 6,
            "1212": 1
        },
        {
            "1023": 1,
            "1030": "Характеристики. Товар с характером 2. Одна позиция на все характеристики Синий",
            "1043": 1,
            "1079": 1,
            "1199": 6,
            "1212": 1
        }
    ],
    "1077": "31044DBC1AF0",
    "1081": 0,
    "1105": 3,
    "1209": 2,
    "1215": 0,
    "1216": 0,
    "1217": 0,
    "fiscalDocumentType": "receipt",
    "qr": "t=20230404T2043&s=3.00&fn=9999078945337305&i=432&fp=1304173296&n=1",
    "short": False
}

all_items = {
    "1012": "2023-04-04T20:44:00+03:00",
    "1018": "112233445573",
    "1020": 6,
    "1021": "Autotestov A.",
    "1031": 6,
    "1037": "0000000001047959",
    "1038": 97,
    "1040": 433,
    "1041": "9999078945337305",
    "1042": 14,
    "1054": 1,
    "1055": 1,
    "1059": [
        {
            "1023": 1,
            "1030": "Характеристики. Товар с характером 2. Одна позиция на все характеристики Желтый",
            "1043": 2,
            "1079": 2,
            "1199": 6,
            "1212": 1
        },
        {
            "1023": 1,
            "1030": "Характеристики. Товар с характером 2. Одна позиция на все характеристики Синий",
            "1043": 1,
            "1079": 1,
            "1199": 6,
            "1212": 1
        },
        {
            "1023": 1,
            "1030": "Характеристики. Товар с характером 1. Отдельная позиция на каждую характеристику Белый",
            "1043": 2,
            "1079": 2,
            "1199": 6,
            "1212": 1
        },
        {
            "1023": 1,
            "1030": "Характеристики. Товар с характером 1. Отдельная позиция на каждую характеристику Черный",
            "1043": 1,
            "1079": 1,
            "1199": 6,
            "1212": 1
        }
    ],
    "1077": "31046782B2DA",
    "1081": 0,
    "1105": 6,
    "1209": 2,
    "1215": 0,
    "1216": 0,
    "1217": 0,
    "fiscalDocumentType": "receipt",
    "qr": "t=20230404T2044&s=6.00&fn=9999078945337305&i=433&fp=1736618714&n=1",
    "short": False
}
