# coding: utf-8

registration_FFD_1_05 = {
  "1001": False,
  "1002": False,
  "1009": "Иу, мкр. Солнечного света, 17",
  "1013": "00108900000016",
  "1017": "7704211201",
  "1018": "112233445573",
  "1037": "0000000001047959",
  "1041": "9999078945337305",
  "1046": "Тестовый ОФД Такском",
  "1048": "ООО \"Milk bar\"",
  "1056": False,
  "1057": 127,
  "1060": "www.nalog.ru",
  "1062": 55,
  "1108": False,
  "1109": False,
  "1110": False,
  "1117": "atol-super-test@mail.ru",
  "1126": False,
  "1187": "торговый зал",
  "1188": "289",
  "1189": 2,
  "1193": False,
  "1207": False,
  "1209": 2,
  "1221": False,
  "fiscalDocumentType": "registration",
  "short": False
}









